---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleY
source: html/abdb0ffe-3a92-47be-3689-0aa4efe14250.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleY Property

The property labeled "Size Y" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".